# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
s_names = (", ".join(names))
print(s_names)

